#include "Trapezoid.h"
#include <iostream>
using std::cout;
using std::endl;

//#############################################################################
//					“Об’єктно-орієнтоване програмування”					   
//												
//		Екзаменаційне завдання для студентів 2 курсу факультету інформатики
//		Національного університету “Києво-Могилянська академія”
//		Весняний триместр 2021-22 навчальний рік
//
//	1. Визначити економний клас трапецій Trapezoid за чотирма вершинами.
//	2. Реалізувати селектори і модифікатори вершин трапеції.
//	3. Знайти відрізки сторін трапеції.
//	4. Підрахувати площу і периметр трапеції.
//	Реалізувати оператори порівняння трапецій за їх площами.
// 
// project : Trapezoid, developed by Ruslan Zymovets (SE-1)
//#############################################################################


int main(void)
{
	{

	}
	Trapezoid t(Point(0, 0), Point(1, 2), Point(3, 2), Point(4, 0));

	cout << t << endl;
	
	cout << std::boolalpha << (t != t2) << endl;
	cout << "area  = " << t.area() << endl;
	cout << "perim = " << t.perimeter() << endl;
	
	t2.set_vertexB(Point(0, 2));
	cout << "area  = " << t2.area() << endl;
	cout << "perim = " << t2.perimeter() << endl;

	return 0;
}