#include "Point.h"

//#############################################################################
//					“Об’єктно-орієнтоване програмування”					   
//												
//		Екзаменаційне завдання для студентів 2 курсу факультету інформатики
//		Національного університету “Києво-Могилянська академія”
//		Весняний триместр 2021-22 навчальний рік
//
//	1. Визначити економний клас трапецій Trapezoid за чотирма вершинами.
//	2. Реалізувати селектори і модифікатори вершин трапеції.
//	3. Знайти відрізки сторін трапеції.
//	4. Підрахувати площу і периметр трапеції.
//	Реалізувати оператори порівняння трапецій за їх площами.
// 
// project : Trapezoid, developed by Ruslan Zymovets (SE-1)
//#############################################################################

	int Point::_freeID = 0;

	Point::Point(const double x, const double y) 
		:	_pointID(++_freeID), 
			_x(x), 
			_y(y)
	{
		return;
	}

	Point::Point(const Point& p) 
		:	_pointID(++_freeID), 
			_x(p._x), 
			_y(p._y)
	{
		return;
	}

	Point::~Point()
	{
		return;
	}
